/* automatically generated by rust-bindgen */

pub const OBX_VERSION_MAJOR: u32 = 0;
pub const OBX_VERSION_MINOR: u32 = 18;
pub const OBX_VERSION_PATCH: u32 = 0;
pub const OBX_ID_NEW: i32 = -1;
pub const OBX_SUCCESS: u32 = 0;
pub const OBX_NOT_FOUND: u32 = 404;
pub const OBX_NO_SUCCESS: u32 = 1001;
pub const OBX_TIMEOUT: u32 = 1002;
pub const OBX_ERROR_ILLEGAL_STATE: u32 = 10001;
pub const OBX_ERROR_ILLEGAL_ARGUMENT: u32 = 10002;
pub const OBX_ERROR_ALLOCATION: u32 = 10003;
pub const OBX_ERROR_NUMERIC_OVERFLOW: u32 = 10004;
pub const OBX_ERROR_FEATURE_NOT_AVAILABLE: u32 = 10005;
pub const OBX_ERROR_SHUTTING_DOWN: u32 = 10006;
pub const OBX_ERROR_NO_ERROR_INFO: u32 = 10097;
pub const OBX_ERROR_GENERAL: u32 = 10098;
pub const OBX_ERROR_UNKNOWN: u32 = 10099;
pub const OBX_ERROR_DB_FULL: u32 = 10101;
pub const OBX_ERROR_MAX_READERS_EXCEEDED: u32 = 10102;
pub const OBX_ERROR_STORE_MUST_SHUTDOWN: u32 = 10103;
pub const OBX_ERROR_MAX_DATA_SIZE_EXCEEDED: u32 = 10104;
pub const OBX_ERROR_DB_GENERAL: u32 = 10198;
pub const OBX_ERROR_STORAGE_GENERAL: u32 = 10199;
pub const OBX_ERROR_UNIQUE_VIOLATED: u32 = 10201;
pub const OBX_ERROR_NON_UNIQUE_RESULT: u32 = 10202;
pub const OBX_ERROR_PROPERTY_TYPE_MISMATCH: u32 = 10203;
pub const OBX_ERROR_ID_ALREADY_EXISTS: u32 = 10210;
pub const OBX_ERROR_ID_NOT_FOUND: u32 = 10211;
pub const OBX_ERROR_TIME_SERIES: u32 = 10212;
pub const OBX_ERROR_CONSTRAINT_VIOLATED: u32 = 10299;
pub const OBX_ERROR_STD_ILLEGAL_ARGUMENT: u32 = 10301;

        entity_uid: obx_uid,
    ) -> obx_err;
}
extern "C" {
    pub fn obx_model_entity_flags(model: *mut OBX_model, flags: OBXEntityFlags) -> obx_err;
}
extern "C" {
    pub fn obx_model_property(
        model: *mut OBX_model,
        name: *const ::std::os::raw::c_char,
        type_: OBXPropertyType,
        property_id: obx_schema_id,
        property_uid: obx_uid,
    ) -> obx_err;
}
extern "C" {
    pub fn obx_model_property_flags(model: *mut OBX_model, flags: OBXPropertyFlags) -> obx_err;
}
extern "C" {
    pub fn obx_model_property_relation(
        model: *mut OBX_model,
        target_entity: *const ::std::os::raw::c_char,
        index_id: obx_schema_id,
        index_uid: obx_uid,
    ) -> obx_err;
}
extern "C" {
    pub fn obx_model_property_index_id(
        model: *mut OBX_model,
        index_id: obx_schema_id,
        index_uid: obx_uid,
    ) -> obx_err;
}
extern "C" {
    pub fn obx_model_relation(
        model: *mut OBX_model,
        relation_id: obx_schema_id,
        relation_uid: obx_uid,
        target_id: obx_schema_id,
        target_uid: obx_uid,
    ) -> obx_err;
}
extern "C" {
    pub fn obx_model_last_entity_id(
        arg1: *mut OBX_model,
        entity_id: obx_schema_id,
        entity_uid: obx_uid,
    );
}
extern "C" {
    pub fn obx_model_last_index_id(
        model: *mut OBX_model,
        index_id: obx_schema_id,
        index_uid: obx_uid,
    );
}
extern "C" {
    pub fn obx_model_last_relation_id(
        model: *mut OBX_model,
        relation_id: obx_schema_id,
        relation_uid: obx_uid,
    );
}
extern "C" {
    pub fn obx_model_entity_last_property_id(
        model: *mut OBX_model,
        property_id: obx_schema_id,
        property_uid: obx_uid,
    ) -> obx_err;
}
#[repr(C)]
pub struct OBX_store {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct OBX_store_options {
    _unused: [u8; 0],
}
pub const OBXDebugFlags_LOG_TRANSACTIONS_READ: OBXDebugFlags = 1;
pub const OBXDebugFlags_LOG_TRANSACTIONS_WRITE: OBXDebugFlags = 2;
pub const OBXDebugFlags_LOG_QUERIES: OBXDebugFlags = 4;
pub const OBXDebugFlags_LOG_QUERY_PARAMETERS: OBXDebugFlags = 8;
pub const OBXDebugFlags_LOG_ASYNC_QUEUE: OBXDebugFlags = 16;
pub const OBXDebugFlags_LOG_CACHE_HITS: OBXDebugFlags = 32;
pub const OBXDebugFlags_LOG_CACHE_ALL: OBXDebugFlags = 64;
pub const OBXDebugFlags_LOG_TREE: OBXDebugFlags = 128;
pub const OBXDebugFlags_LOG_EXCEPTION_STACK_TRACE: OBXDebugFlags = 256;
pub const OBXDebugFlags_RUN_THREADING_SELF_TEST: OBXDebugFlags = 512;
pub type OBXDebugFlags = i32;
pub const OBXPutPaddingMode_PaddingAutomatic: OBXPutPaddingMode = 1;
pub const OBXPutPaddingMode_PaddingAllowedByBuffer: OBXPutPaddingMode = 2;
pub const OBXPutPaddingMode_PaddingByCaller: OBXPutPaddingMode = 3;
pub type OBXPutPaddingMode = i32;
#[repr(C)]
pub struct OBX_bytes {
    pub data: *const ::std::os::raw::c_void,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_OBX_bytes() {
    assert_eq!(
        ::std::mem::size_of::<OBX_bytes>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_bytes))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_bytes>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_bytes))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_bytes>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_bytes),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_bytes>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_bytes),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
pub struct OBX_bytes_array {
    pub bytes: *mut OBX_bytes,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_bytes_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_bytes_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_bytes_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_bytes_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_bytes_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_bytes_array>())).bytes as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_bytes_array),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_bytes_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_bytes_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_bytes_lazy {
    _unused: [u8; 0],
}
extern "C" {
    pub fn obx_bytes_lazy_get(
        bytes: *mut OBX_bytes_lazy,
        out_bytes: *mut *const ::std::os::raw::c_void,
        out_size: *mut usize,
    ) -> obx_err;
}
extern "C" {
    pub fn obx_bytes_lazy_free(bytes: *mut OBX_bytes_lazy);
}
#[repr(C)]
pub struct OBX_id_array {
    pub ids: *mut obx_id,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_id_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_id_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_id_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_id_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_id_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_id_array>())).ids as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_id_array),
            "::",
            stringify!(ids)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_id_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_id_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_string_array {
    pub items: *mut *const ::std::os::raw::c_char,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_string_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_string_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_string_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_string_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_string_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_string_array>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_string_array),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_string_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_string_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_int64_array {
    pub items: *const i64,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_int64_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_int64_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_int64_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_int64_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_int64_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int64_array>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int64_array),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int64_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int64_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_int32_array {
    pub items: *const i32,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_int32_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_int32_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_int32_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_int32_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_int32_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int32_array>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int32_array),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int32_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int32_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_int16_array {
    pub items: *const i16,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_int16_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_int16_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_int16_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_int16_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_int16_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int16_array>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int16_array),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int16_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int16_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_int8_array {
    pub items: *const i8,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_int8_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_int8_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_int8_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_int8_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_int8_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int8_array>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int8_array),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_int8_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_int8_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_double_array {
    pub items: *const f64,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_double_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_double_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_double_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_double_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_double_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_double_array>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_double_array),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_double_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_double_array),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
pub struct OBX_float_array {
    pub items: *const f32,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_OBX_float_array() {
    assert_eq!(
        ::std::mem::size_of::<OBX_float_array>(),
        16usize,
        concat!("Size of: ", stringify!(OBX_float_array))
    );
    assert_eq!(
        ::std::mem::align_of::<OBX_float_array>(),
        8usize,
        concat!("Alignment of ", stringify!(OBX_float_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_float_array>())).items as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_float_array),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<OBX_float_array>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(OBX_float_array),
            "::",
            stringify!(count)
        )
    );
}
extern "C" {
    pub fn obx_opt() -> *mut OBX_store_options;
}
extern "C" {
    pub fn obx_opt_directory(
        opt: *mut OBX_store_options,
        dir: *const ::std::os::raw::c_char,
    ) -> obx_err;
}
extern "C" {
    pub fn obx_opt_max_db_size_in_kb(opt: *mut OBX_store_options, size_in_kb: u64);
}
extern "C" {
    pub fn obx_opt_max_data_size_in_kb(opt: *mut OBX_store_options, size_in_kb: u64);
}
extern "C" {
    pub fn obx_opt_file_mode(opt: *mut OBX_store_options, file_mode: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn obx_opt_max_readers(opt: *mut OBX_store_options, max_readers: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn obx_opt_no_reader_thread_locals(opt: *mut OBX_store_options, flag: bool);
}
extern "C" {
    pub fn obx_opt_model(opt: *mut OBX_store_options, model: *mut OBX_model) -> obx_err;
}
extern "C" {
